/**
 * խի՞ են հրաժարվել ChangeNotifier ից ու ոնց ա ստեղծվել BloC ը
 *
 * Google ից եսիմ ով, ով որ աշխատում էր Flutter ի վրա, ներվայնանում ա, որ էն ամբողջ կոդը, որը որ գրված ա
 * ChangeNotifier հիմքով չի աշխատում Dart Angular ում, որովհետև դա գրված ա Flutter ով, ոչ թե մաքուր Dart ով.
 * Ու որոշում ա լիբ գրի, որը ամբողջովին կարելիա ա ասել փոխարինում ա ChangeNotifier ին, բայց աշխատում ա մաքուր Dart ի Stream երով,
 * որի հետևանքով էլ արդեն կաշխատի ցանկացած տեղ, որտեղ որ աշխատում են Dart ով, հետևաբար նաև Dart Angluar ով.
 */

/**
 *  !!! ԱՄԲՈՂՋ Bloc-Ի ԻՄԱՍՏԸ !!!
 * Bloc ը դա մի բան է, որտեղ կան, մեկ կամ մեկից ավելի Stream եր. Չկա UI , պահվում են ինչ որ տվյալներ.
 * ու իհարկե կարելիա  Stream երին "լսել", ու հենց դա էլ իր ամբողջ իմաստն է.
 *
 */